NordicPlayground/nRF51-ble-app-hrs-s130/ble_app_hrs_c_s130_sdk6_1_github/main.c
/*
 * Copyright (c) 2012 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is confidential property of Nordic Semiconductor. The use,
 * copying, transfer or disclosure of such information is prohibited except by express written
 * agreement with Nordic Semiconductor.
 *
 */

/** @example Board/nrf6310/s120/experimental/ble_app_hrs_c/main.c
 *
 * @brief This example uses ble_app_hrs_c for S120 and ble_app_hrs for S110 to show how the S130 can be used. 
 *        The example works as the following:
 *        The central part of the application can receive heart rate belt data, heart rate value, battery level, 
 *        sensor location, etc, from a peer peripheral*. 
 *        The peripheral part of the application will transmit the heart rate value that the central part of the 
 *        application has received, to a peer central.
 *        Peer peripheral --(hear rate sensor data )--> central --(heart rate value)-- peripheral --(heart rate value)
 *        --> peer central.
 *        *The central will connect to the first heart rate sensor it finds with RSSI higher than RSSI_CRITERIA
 *
 *        The example also shows transmission of data in the other direction:
 *        Peer central --(battery level)--> peripheral --(battery level)-- central
 *        --(battery level)--> peer peripheral*
 *        *The peer peripheral will receive the battery level value from the central provided that its 
 *         battery level characteristic is writable.
 * 
 *        Note: The S110 part of the application does not implement/support bonding.
 *
 * This file contains the source code for a sample heart rate collector.
 */

#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf_sdm.h"
#include "ble.h"
#include "ble_db_discovery_s130.h"
#include "softdevice_handler.h"
#include "app_util.h"
#include "app_error.h"
#include "ble_advdata_parser.h"
#include "boards.h"
#include "nrf6350.h"
#include "nrf_gpio.h"
#include "pstorage.h"
#include "device_manager_s130.h"
#include "app_trace.h"
#include "ble_hrs_c.h"
#include "ble_bas_c.h"
#include "app_util.h"

// Peripheral includes
#include "ble_bas_s130.h"
#include "ble_hrs_s130.h"
#include "ble_dis.h"
#include "ble_sensorsim.h"
#include "app_timer.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_conn_params_s130.h"
#include "ble_hci.h"
#include "nrf_delay.h"

// Peripheral settings
#define PERIPHERAL_ADV_LED_PIN_NO                   LED_6                                          /**< Is on when device is scanning. */
#define PERIPHERAL_CONNECTED_LED_PIN_NO             LED_5                                          /**< Is on when device has connected. */

#define PERIPHERAL_BONDMNGR_DELETE_BUTTON_PIN_NO   BUTTON_7

#define PERIPHERAL_DEVICE_NAME                          "S130"                               /**< Name of device. Will be included in the advertising data. */
#define PERIPHERAL_MANUFACTURER_NAME                    "NordicSemiconductor"                      /**< Manufacturer. Will be passed to Device Information Service. */
#define PERIPHERAL_APP_ADV_INTERVAL                     40                                         /**< The advertising interval (in units of 0.625 ms. This value corresponds to 25 ms). */
#define PERIPHERAL_APP_ADV_TIMEOUT_IN_SECONDS           0 //180                                        /**< The advertising timeout in units of seconds. */


#define PERIPHERAL_APP_TIMER_PRESCALER                  0                                          /**< Value of the RTC1 PRESCALER register. */
#define PERIPHERAL_APP_TIMER_MAX_TIMERS                 5                                          /**< Maximum number of simultaneously created timers. */
#define PERIPHERAL_APP_TIMER_OP_QUEUE_SIZE              4                                          /**< Size of timer operation queues. */

#define PERIPHERAL_BATTERY_LEVEL_MEAS_INTERVAL          APP_TIMER_TICKS(2000, PERIPHERAL_APP_TIMER_PRESCALER) /**< Battery level measurement interval (ticks). */
#define PERIPHERAL_MIN_BATTERY_LEVEL                    81                                         /**< Minimum simulated battery level. */
#define PERIPHERAL_MAX_BATTERY_LEVEL                    100                                        /**< Maximum simulated battery level. */
#define PERIPHERAL_BATTERY_LEVEL_INCREMENT              1                                          /**< Increment between each simulated battery level measurement. */

#define PERIPHERAL_HEART_RATE_MEAS_INTERVAL             APP_TIMER_TICKS(1000, PERIPHERAL_APP_TIMER_PRESCALER) /**< Heart rate measurement interval (ticks). */
#define PERIPHERAL_MIN_HEART_RATE                       140                                        /**< Minimum heart rate as returned by the simulated measurement function. */
#define PERIPHERAL_MAX_HEART_RATE                       300                                        /**< Maximum heart rate as returned by the simulated measurement function. */
#define PERIPHERAL_HEART_RATE_INCREMENT                 10                                         /**< Value by which the heart rate is incremented/decremented for each call to the simulated measurement function. */

#define PERIPHERAL_RR_INTERVAL_INTERVAL                 APP_TIMER_TICKS(300, PERIPHERAL_APP_TIMER_PRESCALER)  /**< RR interval interval (ticks). */
#define PERIPHERAL_MIN_RR_INTERVAL                      100                                        /**< Minimum RR interval as returned by the simulated measurement function. */
#define PERIPHERAL_MAX_RR_INTERVAL                      500                                        /**< Maximum RR interval as returned by the simulated measurement function. */
#define PERIPHERAL_RR_INTERVAL_INCREMENT                1                                          /**< Value by which the RR interval is incremented/decremented for each call to the simulated measurement function. */

#define PERIPHERAL_SENSOR_CONTACT_DETECTED_INTERVAL     APP_TIMER_TICKS(5000, PERIPHERAL_APP_TIMER_PRESCALER) /**< Sensor Contact Detected toggle interval (ticks). */

