NordicPlayground/nRF51-ble-app-hrs-s130/ble_app_hrs_c_s130_sdk6_1_github/main.c
#define PERIPHERAL_MIN_CONN_INTERVAL                    MSEC_TO_UNITS(500, UNIT_1_25_MS)           /**< Minimum acceptable connection interval (0.5 seconds). */
#define PERIPHERAL_MAX_CONN_INTERVAL                    MSEC_TO_UNITS(1000, UNIT_1_25_MS)          /**< Maximum acceptable connection interval (1 second). */
#define PERIPHERAL_SLAVE_LATENCY                        0                                          /**< Slave latency. */
#define PERIPHERAL_CONN_SUP_TIMEOUT                     MSEC_TO_UNITS(4000, UNIT_10_MS)           /**< Connection supervisory timeout (4 seconds). */

#define PERIPHERAL_FIRST_CONN_PARAMS_UPDATE_DELAY       APP_TIMER_TICKS(5000, PERIPHERAL_APP_TIMER_PRESCALER) /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define PERIPHERAL_NEXT_CONN_PARAMS_UPDATE_DELAY        APP_TIMER_TICKS(5000, PERIPHERAL_APP_TIMER_PRESCALER) /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define PERIPHERAL_MAX_CONN_PARAMS_UPDATE_COUNT         3                                          /**< Number of attempts before giving up the connection parameter negotiation. */

#define PERIPHERAL_SEC_PARAM_TIMEOUT                    30                                         /**< Timeout for Pairing Request or Security Request (in seconds). */
#define PERIPHERAL_SEC_PARAM_BOND                       1                                          /**< Perform bonding. */
#define PERIPHERAL_SEC_PARAM_MITM                       0                                          /**< Man In The Middle protection not required. */
#define PERIPHERAL_SEC_PARAM_IO_CAPABILITIES            BLE_GAP_IO_CAPS_NONE                       /**< No I/O capabilities. */
#define PERIPHERAL_SEC_PARAM_OOB                        0                                          /**< Out Of Band data not available. */
#define PERIPHERAL_SEC_PARAM_MIN_KEY_SIZE               7                                          /**< Minimum encryption key size. */
#define PERIPHERAL_SEC_PARAM_MAX_KEY_SIZE               16                                         /**< Maximum encryption key size. */

#define DEAD_BEEF                            0xDEADBEEF                                 /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

static uint16_t                              m_peripheral_conn_handle = BLE_CONN_HANDLE_INVALID;   /**< Handle of the current connection. */
static ble_gap_sec_params_t                  m_peripheral_sec_params;                              /**< Security requirements for this application. */
static ble_gap_adv_params_t                  m_peripheral_adv_params;                              /**< Parameters to be passed to the stack when starting advertising. */
static ble_bas_t                             m_peripheral_bas;                                     /**< Structure used to identify the battery service. */
static ble_hrs_t                             m_peripheral_hrs;                                     /**< Structure used to identify the heart rate service. */
static bool                                  m_peripheral_rr_interval_enabled = true;              /**< Flag for enabling and disabling the registration of new RR interval measurements (the purpose of disabling this is just to test sending HRM without RR interval data. */

static ble_sensorsim_cfg_t                   m_peripheral_battery_sim_cfg;                         /**< Battery Level sensor simulator configuration. */
static ble_sensorsim_state_t                 m_peripheral_battery_sim_state;                       /**< Battery Level sensor simulator state. */
static ble_sensorsim_cfg_t                   m_peripheral_heart_rate_sim_cfg;                      /**< Heart Rate sensor simulator configuration. */
static ble_sensorsim_state_t                 m_peripheral_heart_rate_sim_state;                    /**< Heart Rate sensor simulator state. */
static ble_sensorsim_cfg_t                   m_peripheral_rr_interval_sim_cfg;                     /**< RR Interval sensor simulator configuration. */
static ble_sensorsim_state_t                 m_peripheral_rr_interval_sim_state;                   /**< RR Interval sensor simulator state. */

static app_timer_id_t                        m_peripheral_battery_timer_id;                        /**< Battery timer. */
static app_timer_id_t                        m_peripheral_heart_rate_timer_id;                     /**< Heart rate measurement timer. */
static app_timer_id_t                        m_peripheral_rr_interval_timer_id;                    /**< RR interval timer. */
static app_timer_id_t                        m_peripheral_sensor_contact_timer_id;                 /**< Sensor contact detected timer. */


static bool                                  m_peripheral_start_advertising = false;                        /**< Variable setting if advertising should start or not. */
static bool                                  m_central_is_scanning          = false;                        /**< Variable telling if the central is scanning or not. */

// Central settings

#define BOND_DELETE_ALL_BUTTON_ID  BUTTON_1                           /**< Button used for deleting all bonded centrals during startup. */

#define SCAN_LED_PIN_NO                  LED_0                                          /**< Is on when device is scanning. */
#define CONNECTED_LED_PIN_NO             LED_1                                          /**< Is on when device has connected. */
#define ASSERT_LED_PIN_NO                LED_7                                          /**< Is on when application has asserted. */
#define RSSI_CRITERIA                    -50                         /**< Minimum RSSI value for peer peripheral. */        

#define APPL_LOG                         app_trace_log                                  /**< Debug logger macro that will be used in this file to do logging of debug information over UART. */

#define SEC_PARAM_BOND             0                                   /**< Perform bonding. */
#define SEC_PARAM_MITM             0                                 /**< Man In The Middle protection not required. */
#define SEC_PARAM_IO_CAPABILITIES  BLE_GAP_IO_CAPS_NONE               /**< No I/O capabilities. */
#define SEC_PARAM_OOB              0                                  /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE     7                                  /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE     16                                 /**< Maximum encryption key size. */

#define SCAN_INTERVAL              0x00A0                             /**< Determines scan interval in units of 0.625 millisecond. */
#define SCAN_WINDOW                0x0050                             /**< Determines scan window in units of 0.625 millisecond. */

#define MIN_CONNECTION_INTERVAL    MSEC_TO_UNITS(7.5, UNIT_1_25_MS)   /**< Determines maximum connection interval in millisecond. */
#define MAX_CONNECTION_INTERVAL    MSEC_TO_UNITS(30, UNIT_1_25_MS)    /**< Determines maximum connection interval in millisecond. */
#define SLAVE_LATENCY              0                                  /**< Determines slave latency in counts of connection events. */
#define SUPERVISION_TIMEOUT        MSEC_TO_UNITS(4000, UNIT_10_MS)    /**< Determines supervision time-out in units of 10 millisecond. */

#define TARGET_UUID                0x180D                             /**< Target device name that application is looking for. */
#define MAX_PEER_COUNT             DEVICE_MANAGER_MAX_CONNECTIONS     /**< Maximum number of peer's application intends to manage. */
#define UUID16_SIZE                2                                  /**< Size of 16 bit UUID */

/**@breif Macro to unpack 16bit unsigned UUID from octet stream. */
#define UUID16_EXTRACT(DST,SRC)                                                                  \
        do                                                                                       \
        {                                                                                        \
            (*(DST)) = (SRC)[1];                                                                 \
            (*(DST)) <<= 8;                                                                      \
            (*(DST)) |= (SRC)[0];                                                                \
        } while(0)

/**@brief Variable length data encapsulation in terms of length and pointer to data */
typedef struct
{
    uint8_t     * p_data;                                         /**< Pointer to data. */
    uint16_t      data_len;                                       /**< Length of data. */
}data_t;

