NordicPlayground/nRF51-ble-app-hrs-s130/ble_app_hrs_c_s130_sdk6_1_github/main.c
    p_data = p_advdata->p_data;

    while (index < p_advdata->data_len)
    {
        uint8_t field_length = p_data[index];
        uint8_t field_type = p_data[index+1];

        if (field_type == type)
        {
            p_typedata->p_data = &p_data[index+2];
            p_typedata->data_len = field_length-1;
            return NRF_SUCCESS;
        }
        index += field_length+1;
    }
    return NRF_ERROR_NOT_FOUND;
}

/**@brief Function for starting advertising.
 */
static void peripheral_advertising_start(void)
{
    uint32_t err_code;

    err_code = sd_ble_gap_adv_start(&m_peripheral_adv_params);
    APP_ERROR_CHECK(err_code);
    
    m_peripheral_start_advertising = false;
    nrf_gpio_pin_set(PERIPHERAL_ADV_LED_PIN_NO);
}




/**@brief Function for handling the Application's BLE Stack events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t                err_code;
    const ble_gap_evt_t   * p_gap_evt = &p_ble_evt->evt.gap_evt;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            if(p_ble_evt->evt.gap_evt.params.connected.role == BLE_GAP_ROLE_PERIPH) //If this side is BLE_GAP_ROLE_PERIPH then BLE_GAP_EVT_CONNECTED comes from peer central
            {
                //Connected as peripheral
                nrf_gpio_pin_set(PERIPHERAL_CONNECTED_LED_PIN_NO);
                nrf_gpio_pin_clear(PERIPHERAL_ADV_LED_PIN_NO);
                m_peripheral_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            }
            break;
            
        case BLE_GAP_EVT_ADV_REPORT:
        {
            data_t adv_data;
            data_t type_data;

            // Initialize advertisement report for parsing.
            adv_data.p_data = (uint8_t *)p_gap_evt->params.adv_report.data;
            adv_data.data_len = p_gap_evt->params.adv_report.dlen;

            err_code = adv_report_parse(BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_MORE_AVAILABLE,
                                        &adv_data,
                                        &type_data);
            if (err_code != NRF_SUCCESS)
            {
                // Compare short local name in case complete name does not match.
                err_code = adv_report_parse(BLE_GAP_AD_TYPE_16BIT_SERVICE_UUID_COMPLETE,
                                            &adv_data,
                                            &type_data);
            }

            // Verify if short or complete name matches target.
            if (err_code == NRF_SUCCESS)
            {
                uint16_t extracted_uuid;

                // UUIDs found, look for matching UUID
                for (uint32_t u_index = 0; u_index < (type_data.data_len/UUID16_SIZE); u_index++)
                {
                    UUID16_EXTRACT(&extracted_uuid,&type_data.p_data[u_index * UUID16_SIZE]);

                    APPL_LOG("\t[APPL]: %x\r\n",extracted_uuid);

                    if(extracted_uuid == TARGET_UUID)
                    {
                        
                        // Stop scanning and initiate connection if the rssi value is larger than RSSI_CRITERIA 
                        if(p_ble_evt->evt.gap_evt.params.adv_report.rssi >= RSSI_CRITERIA)
                        {
                            // Stop scanning.
                            err_code = sd_ble_gap_scan_stop();
                            if (err_code != NRF_SUCCESS)
                            {
                                APPL_LOG("[APPL]: Scan stop failed, reason %d\r\n", err_code);
                            }
                            m_central_is_scanning = false;
                            nrf_gpio_pin_clear(SCAN_LED_PIN_NO);
                            
                            m_scan_param.selective = 0; 

                            err_code = sd_ble_gap_connect(&p_gap_evt->params.adv_report.\
                                                        peer_addr,
                                                        &m_scan_param,
                                                        &m_connection_param);
    
                            if (err_code != NRF_SUCCESS)
                            {
                                APPL_LOG("[APPL]: Connection Request Failed, reason %d\r\n", err_code);
                            }
                        }
                        break;
                    }
                }
            }
            break;
        }
        
        case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
            // Peripheral (bonding is not implemented)
            err_code = sd_ble_gap_sec_params_reply(m_peripheral_conn_handle,
                                                   BLE_GAP_SEC_STATUS_SUCCESS,
                                                   &m_peripheral_sec_params, NULL);
        
        case BLE_GAP_EVT_TIMEOUT:
            if(p_gap_evt->conn_handle != m_peripheral_conn_handle)
            {
                 if(p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_SCAN)
                 {
                     APPL_LOG("[APPL]: Scan timed out.\r\n");
                     if (m_scan_mode ==  BLE_WHITELIST_SCAN)
                     {
                         m_scan_mode = BLE_FAST_SCAN;
     
                         // Start non selective scanning.
                         scan_start();
                     }
                 }
                 else if (p_gap_evt->params.timeout.src == BLE_GAP_TIMEOUT_SRC_CONN)
                 {
                     APPL_LOG("[APPL]: Connection Request timed out.\r\n");
                 }
            }
            break;
        case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
            // Accepting parameters requested by peer.
            err_code = sd_ble_gap_conn_param_update(p_gap_evt->conn_handle,
                                                    &p_gap_evt->params.conn_param_update_request.conn_params);
            APP_ERROR_CHECK(err_code);
            break;
        
        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
            err_code = sd_ble_gatts_sys_attr_set(m_peripheral_conn_handle, NULL, 0);
            APP_ERROR_CHECK(err_code);
            break;
        
        case BLE_GAP_EVT_DISCONNECTED:
            if(p_gap_evt->conn_handle == m_peripheral_conn_handle)
            {
                m_peripheral_conn_handle = BLE_CONN_HANDLE_INVALID;
                nrf_gpio_pin_clear(PERIPHERAL_CONNECTED_LED_PIN_NO);
                APPL_LOG("[APPL]: BLE_GAP_EVT_DISCONNECTED: disconnected\r\n");
                m_peripheral_start_advertising = true;
            } 
            break;
        
            
        default:
            break;
    }
}

/**@brief Function for handling the Application's system events.
 *
 * @param[in]   sys_evt   system event.
 */
static void on_sys_evt(uint32_t sys_evt)
{
    switch(sys_evt)
    {
        case NRF_EVT_FLASH_OPERATION_SUCCESS:
        case NRF_EVT_FLASH_OPERATION_ERROR:
            if (m_memory_access_in_progress)
            {
                m_memory_access_in_progress = false;
                scan_start();
            }
            break;
        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for dispatching a BLE stack event to all modules with a BLE stack event handler.
 *
 * @details This function is called from the scheduler in the main loop after a BLE stack event has
 *  been received.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 */
static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
    dm_ble_evt_handler(&m_peripheral_conn_handle, p_ble_evt); 
    ble_db_discovery_on_ble_evt(&m_peripheral_conn_handle, &m_ble_db_discovery, p_ble_evt);
    ble_hrs_c_on_ble_evt(&m_ble_hrs_c, p_ble_evt);
    ble_bas_c_on_ble_evt(&m_ble_bas_c, p_ble_evt);
    ble_hrs_on_ble_evt(&m_peripheral_conn_handle, &m_peripheral_hrs, p_ble_evt);
    ble_bas_on_ble_evt(&m_peripheral_conn_handle, &m_peripheral_bas, p_ble_evt);
    ble_conn_params_on_ble_evt(&m_peripheral_conn_handle, p_ble_evt);
    on_ble_evt(p_ble_evt);
}


/**@brief Function for dispatching a system event to interested modules.
 *
 * @details This function is called from the System event interrupt handler after a system
 *          event has been received.
 *
 * @param[in]   sys_evt   System stack event.
 */
static void sys_evt_dispatch(uint32_t sys_evt)
{
    pstorage_sys_event_handler(sys_evt); 
    on_sys_evt(sys_evt);
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(NRF_CLOCK_LFCLKSRC_XTAL_20_PPM, false);
    
    //Enable BLE stack 
    //ble_enable_params_t ble_enable_params;
    //memset(&ble_enable_params, 0, sizeof(ble_enable_params));
    //ble_enable_params.gatts_enable_params.service_changed = 0;
    //err_code = sd_ble_enable(&ble_enable_params);
    //APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for System events.
    err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Device Manager.
 *
 * @details Device manager is initialized here.
 */
static void device_manager_init(void)
{
    dm_application_param_t param;
    dm_init_param_t        init_param;

    uint32_t              err_code;

