NordicPlayground/nRF51-ble-app-hrs-s130/ble_app_hrs_c_s130_sdk6_1_github/main.c
    // Initialize Device Information Service.
    memset(&dis_init, 0, sizeof(dis_init));

    ble_srv_ascii_to_utf8(&dis_init.manufact_name_str, (char *)PERIPHERAL_MANUFACTURER_NAME);

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&dis_init.dis_attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_NO_ACCESS(&dis_init.dis_attr_md.write_perm);

    err_code = ble_dis_init(&dis_init);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the sensor simulators.
 */
static void peripheral_sensor_sim_init(void)
{
    m_peripheral_battery_sim_cfg.min          = PERIPHERAL_MIN_BATTERY_LEVEL;
    m_peripheral_battery_sim_cfg.max          = PERIPHERAL_MAX_BATTERY_LEVEL;
    m_peripheral_battery_sim_cfg.incr         = PERIPHERAL_BATTERY_LEVEL_INCREMENT;
    m_peripheral_battery_sim_cfg.start_at_max = true;

    ble_sensorsim_init(&m_peripheral_battery_sim_state, &m_peripheral_battery_sim_cfg);

    m_peripheral_heart_rate_sim_cfg.min          = PERIPHERAL_MIN_HEART_RATE;
    m_peripheral_heart_rate_sim_cfg.max          = PERIPHERAL_MAX_HEART_RATE;
    m_peripheral_heart_rate_sim_cfg.incr         = PERIPHERAL_HEART_RATE_INCREMENT;
    m_peripheral_heart_rate_sim_cfg.start_at_max = false;

    ble_sensorsim_init(&m_peripheral_heart_rate_sim_state, &m_peripheral_heart_rate_sim_cfg);

    m_peripheral_rr_interval_sim_cfg.min          = PERIPHERAL_MIN_RR_INTERVAL;
    m_peripheral_rr_interval_sim_cfg.max          = PERIPHERAL_MAX_RR_INTERVAL;
    m_peripheral_rr_interval_sim_cfg.incr         = PERIPHERAL_RR_INTERVAL_INCREMENT;
    m_peripheral_rr_interval_sim_cfg.start_at_max = false;

    ble_sensorsim_init(&m_peripheral_rr_interval_sim_state, &m_peripheral_rr_interval_sim_cfg);
}

/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in]   p_evt   Event received from the Connection Parameters Module.
 */
static void peripheral_on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if(p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_peripheral_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void peripheral_conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;

    memset(&cp_init, 0, sizeof(cp_init));

    cp_init.p_conn_params                  = NULL;
    cp_init.first_conn_params_update_delay = PERIPHERAL_FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = PERIPHERAL_NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = PERIPHERAL_MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = m_peripheral_hrs.hrm_handles.cccd_handle;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = peripheral_on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing security parameters.
 */
static void peripheral_sec_params_init(void)
{
    //m_peripheral_sec_params.timeout      = PERIPHERAL_SEC_PARAM_TIMEOUT;
    m_peripheral_sec_params.bond         = PERIPHERAL_SEC_PARAM_BOND;
    m_peripheral_sec_params.mitm         = PERIPHERAL_SEC_PARAM_MITM;
    m_peripheral_sec_params.io_caps      = PERIPHERAL_SEC_PARAM_IO_CAPABILITIES;
    m_peripheral_sec_params.oob          = PERIPHERAL_SEC_PARAM_OOB;
    m_peripheral_sec_params.min_key_size = PERIPHERAL_SEC_PARAM_MIN_KEY_SIZE;
    m_peripheral_sec_params.max_key_size = PERIPHERAL_SEC_PARAM_MAX_KEY_SIZE;
}

/**@brief Function for starting application timers.
 */
static void peripheral_application_timers_start(void)
{
    uint32_t err_code;

    // Start application timers
    err_code = app_timer_start(m_peripheral_battery_timer_id, PERIPHERAL_BATTERY_LEVEL_MEAS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_peripheral_heart_rate_timer_id, PERIPHERAL_HEART_RATE_MEAS_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_peripheral_rr_interval_timer_id, PERIPHERAL_RR_INTERVAL_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_start(m_peripheral_sensor_contact_timer_id, PERIPHERAL_SENSOR_CONTACT_DETECTED_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
}


int main(void)
{
    
    // Initialization of various modules.
    uint32_t err_code;
    
    app_trace_init();
    leds_init();
    buttons_init();
    nrf6350_init();
    ble_stack_init();
    device_manager_init();
    db_discovery_init();
    hrs_c_init();
    bas_c_init();
    
    
    peripheral_timers_init();
    peripheral_gap_params_init();
    peripheral_advertising_init();
    peripheral_services_init();
    peripheral_sensor_sim_init();
    peripheral_conn_params_init();
    peripheral_sec_params_init();
    
    peripheral_application_timers_start();
    peripheral_advertising_start();

    // Start scanning for peripherals and initiate connection
    // with devices that advertise Heart Rate UUID.
    scan_start();
    m_peripheral_start_advertising = false;
    for (;;)
    {
        power_manage();
        
        // Start advertising
        if( m_peripheral_start_advertising == true)
        {
            if (m_central_is_scanning == true)
            {
                err_code = sd_ble_gap_scan_stop();
                APP_ERROR_CHECK(err_code);
                nrf_gpio_pin_clear(SCAN_LED_PIN_NO);
            }
                
            peripheral_advertising_start();
            if (m_central_is_scanning == true)
            {
                scan_start(); // only if the device was already scanning.
            }
 
        }
    }
}


